app/controllers/admmin/diaries_controller.rb

SELECT `diaries`.* FROM `diaries`
---
  def index
    @diaries = Diary.all

SELECT `diaries`.* FROM `diaries` WHERE `diaries`.`id` = 1 LIMIT 1
---
  def show
    @diary = Diary.find(params[:id])

SELECT `diaries`.* FROM `diaries` WHERE `diaries`.`id` = 1 LIMIT 1
---
  def edit
    @diary = Diary.find(params[:id])

INSERT INTO `diaries` (`created_at`, `state`, `tag_id`, `text`, `title`, `updated_at`, `visibility`) VALUES ('2012-11-19 09:59:36', 2, NULL, '\r\n\r\n\r\n#3つのニーズを満たす：\r\n\r\n####ユニバニーズ\r\n	：高バジェット、リアルタイムウェブ、サーバーサイド美学など\r\n####クライアントニーズ\r\n	：誘引したい、ポップな感じ、横展開したいなど\r\n\r\n####テクノロジーニーズ\r\n	：passbookの面白さって動的な面白さ、とか…\r\n\r\n\r\n\r\n\r\n#####ユニバニーズを追求する\r\n実績の監視 \r\nアイデアの監視\r\n\r\n\r\n#####クライアントニーズを追求する\r\n\r\n顧客カルテ(500マン以上のレポート) \r\n顧客インプレッションメモ\r\n\r\n#####テクノロジーニーズを追求する\r\n技術の自在な解釈 \r\n', 'matter', '2012-11-19 09:59:36', 1)
---
  def create
    @diary = Diary.new(params[:diary])

    respond_to do |format|
      if @diary.save

SELECT `diaries`.* FROM `diaries` WHERE `diaries`.`id` = 2 LIMIT 1
UPDATE `diaries` SET `visibility` = 0, `updated_at` = '2012-11-19 10:08:49' WHERE `diaries`.`id` = 2
---
  def update
    @diary = Diary.find(params[:id])

    respond_to do |format|
      if @diary.update_attributes(params[:diary])