app/controllers/hellos_controller.rb

SELECT `diaries`.* FROM `diaries` WHERE (1)
---
  def index
    @diaries = Diary.where(1)